# 직접 해보세요!
## 누락값 확인하기(135쪽)

In [32]:
from numpy import NaN, NAN, nan

In [33]:
print(NaN == True)

False

In [34]:
print(NaN == False)

False

In [35]:
print(NaN == 0)

False

In [36]:
print(NaN == '')

False

---

In [37]:
print(NaN == NaN)

False

In [38]:
print(NaN == nan)

False

In [39]:
print(NaN == NAN)

False

In [40]:
print(nan == NAN)

False

---

In [41]:
import pandas as pd 

print(pd.isnull(NaN))

True

In [42]:
print(pd.isnull(nan))

True

In [43]:
print(pd.isnull(NAN))

True

In [44]:
print(pd.notnull(NaN))

False

In [45]:
print(pd.notnull(42))

True

In [46]:
print(pd.notnull('missing'))

True

# 직접 해보세요!
## 누락값이 생기는 이유 알아보기(137쪽)

### 1. 누락값이 있는 데이터 집합을 연결할 때 누락값이 생기는 경우

In [8]:
visited = pd.read_csv('../data/survey_visited.csv') 
survey = pd.read_csv('../data/survey_survey.csv')

print(visited)

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

In [2]:
print(survey)

    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
8     735    NaN   sal     0.06
9     735    NaN  temp   -26.00
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
16    752    roe   sal    41.60
17    837   lake   rad     1.46
18    837   lake   sal     0.21
19    837    roe   sal    22.50
20    844    roe   rad    11.25

In [3]:
vs = visited.merge(survey, left_on='ident', right_on='taken') 
print(vs)

    ident   site       dated  taken person quant  reading
0     619   DR-1  1927-02-08    619   dyer   rad     9.82
1     619   DR-1  1927-02-08    619   dyer   sal     0.13
2     622   DR-1  1927-02-10    622   dyer   rad     7.80
3     622   DR-1  1927-02-10    622   dyer   sal     0.09
4     734   DR-3  1939-01-07    734     pb   rad     8.41
5     734   DR-3  1939-01-07    734   lake   sal     0.05
6     734   DR-3  1939-01-07    734     pb  temp   -21.50
7     735   DR-3  1930-01-12    735     pb   rad     7.22
8     735   DR-3  1930-01-12    735    NaN   sal     0.06
9     735   DR-3  1930-01-12    735    NaN  temp   -26.00
10    751   DR-3  1930-02-26    751     pb   rad     4.35
11    751   DR-3  1930-02-26    751     pb  temp   -18.50
12    751   DR-3  1930-02-26    751   lake   sal     0.10
13    752   DR-3         NaN    752   lake   rad     2.19
14    752   DR-3         NaN    752   lake   sal     0.09
15    752   DR-3         NaN    752   lake  temp   -16.00
16    752   DR-3         NaN    752    roe   sal    41.60
17    837  MSK-4  1932-01-14    837   lake   rad     1.46
18    837  MSK-4  1932-01-14    837   lake   sal     0.21
19    837  MSK-4  1932-01-14    837    roe   sal    22.50
20    844   DR-1  1932-03-22    844    roe   rad    11.25

### 3. 데이터를 입력할 때 누락값이 생기는 경우

In [5]:
from numpy import NaN, NAN, nan
num_legs = pd.Series({'goat': 4, 'amoeba': nan}) 
print(num_legs)
print(type(num_legs))

goat      4.0
amoeba    NaN
dtype: float64
<class 'pandas.core.series.Series'>

In [6]:
scientists = pd.DataFrame({ 
    'Name': ['Rosaline Franklin', 'William Gosset'], 
    'Occupation': ['Chemist', 'Statistician'], 
    'Born': ['1920-07-25', '1876-06-13'], 
    'Died': ['1958-04-16', '1937-10-16'], 
    'missing': [NaN, nan]}) 

print(scientists)
print(type(scientists))

                Name    Occupation        Born        Died  missing
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16      NaN
1     William Gosset  Statistician  1876-06-13  1937-10-16      NaN
<class 'pandas.core.frame.DataFrame'>

### 4. 범위를 지정하여 데이터를 추출할 때 누락값이 생기는 경우

In [9]:
gapminder = pd.read_csv('../data/gapminder.tsv', sep='\t')

In [10]:
life_exp = gapminder.groupby(['year'])['lifeExp'].mean() 
print(life_exp)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [22]:
print(life_exp.loc[range(2000, 2010), ])

year
2000          NaN
2001          NaN
2002    65.694923
2003          NaN
2004          NaN
2005          NaN
2006          NaN
2007    67.007423
2008          NaN
2009          NaN
Name: lifeExp, dtype: float64

C:\Users\phk70\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

In [24]:
y2000 = life_exp[life_exp.index > 2000] 
print(y2000)

year
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

# 직접 해보세요!
## 누락값의 개수 구하기(142쪽)

In [11]:
ebola = pd.read_csv('../data/country_timeseries.csv')

In [12]:
print(ebola.count())

Date                   122
Day                    122
Cases_Guinea            93
Cases_Liberia           83
Cases_SierraLeone       87
Cases_Nigeria           38
Cases_Senegal           25
Cases_UnitedStates      18
Cases_Spain             16
Cases_Mali              12
Deaths_Guinea           92
Deaths_Liberia          81
Deaths_SierraLeone      87
Deaths_Nigeria          38
Deaths_Senegal          22
Deaths_UnitedStates     18
Deaths_Spain            16
Deaths_Mali             12
dtype: int64

In [13]:
num_rows = ebola.shape[0]
num_missing = num_rows - ebola.count() 
print(num_missing)

Date                     0
Day                      0
Cases_Guinea            29
Cases_Liberia           39
Cases_SierraLeone       35
Cases_Nigeria           84
Cases_Senegal           97
Cases_UnitedStates     104
Cases_Spain            106
Cases_Mali             110
Deaths_Guinea           30
Deaths_Liberia          41
Deaths_SierraLeone      35
Deaths_Nigeria          84
Deaths_Senegal         100
Deaths_UnitedStates    104
Deaths_Spain           106
Deaths_Mali            110
dtype: int64

In [29]:
import numpy as np 

print(np.count_nonzero(ebola.isnull()))

1214

In [51]:
print(np.count_nonzero(ebola['Cases_Guinea'].isnull()))

29

In [52]:
print(ebola.Cases_Guinea.value_counts(dropna=False).head())

NaN       29
 86.0      3
 495.0     2
 112.0     2
 390.0     2
Name: Cases_Guinea, dtype: int64

# 직접 해보세요!
## 누락값 처리하기 ― 변경, 삭제(144쪽)

### 1. 누락값 변경하기
- fillna
- interpolate

In [53]:
print(ebola.fillna(0).iloc[0:10, 0:5])

         Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
0    1/5/2015  289        2776.0            0.0            10030.0
1    1/4/2015  288        2775.0            0.0             9780.0
2    1/3/2015  287        2769.0         8166.0             9722.0
3    1/2/2015  286           0.0         8157.0                0.0
4  12/31/2014  284        2730.0         8115.0             9633.0
5  12/28/2014  281        2706.0         8018.0             9446.0
6  12/27/2014  280        2695.0            0.0             9409.0
7  12/24/2014  277        2630.0         7977.0             9203.0
8  12/21/2014  273        2597.0            0.0             9004.0
9  12/20/2014  272        2571.0         7862.0             8939.0

In [30]:
ebola.iloc[0:10, 0:5]

         Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
0    1/5/2015  289        2776.0            NaN            10030.0
1    1/4/2015  288        2775.0            NaN             9780.0
2    1/3/2015  287        2769.0         8166.0             9722.0
3    1/2/2015  286           NaN         8157.0                NaN
4  12/31/2014  284        2730.0         8115.0             9633.0
5  12/28/2014  281        2706.0         8018.0             9446.0
6  12/27/2014  280        2695.0            NaN             9409.0
7  12/24/2014  277        2630.0         7977.0             9203.0
8  12/21/2014  273        2597.0            NaN             9004.0
9  12/20/2014  272        2571.0         7862.0             8939.0

In [32]:
ebola.fillna(method='ffill').iloc[0:10, 0:5] ##method='ffill'로 하면 누락값이 나타나기 전 행의 값으로 누락값이 변경됨

         Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
0    1/5/2015  289        2776.0            NaN            10030.0
1    1/4/2015  288        2775.0            NaN             9780.0
2    1/3/2015  287        2769.0         8166.0             9722.0
3    1/2/2015  286        2769.0         8157.0             9722.0
4  12/31/2014  284        2730.0         8115.0             9633.0
5  12/28/2014  281        2706.0         8018.0             9446.0
6  12/27/2014  280        2695.0         8018.0             9409.0
7  12/24/2014  277        2630.0         7977.0             9203.0
8  12/21/2014  273        2597.0         7977.0             9004.0
9  12/20/2014  272        2571.0         7862.0             8939.0

In [33]:
print(ebola.fillna(method='bfill').iloc[0:10, 0:5]) ##method='bfill'로 하면 누락값이 나타난 이후의 첫번째 값으로 변경

         Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
0    1/5/2015  289        2776.0         8166.0            10030.0
1    1/4/2015  288        2775.0         8166.0             9780.0
2    1/3/2015  287        2769.0         8166.0             9722.0
3    1/2/2015  286        2730.0         8157.0             9633.0
4  12/31/2014  284        2730.0         8115.0             9633.0
5  12/28/2014  281        2706.0         8018.0             9446.0
6  12/27/2014  280        2695.0         7977.0             9409.0
7  12/24/2014  277        2630.0         7977.0             9203.0
8  12/21/2014  273        2597.0         7862.0             9004.0
9  12/20/2014  272        2571.0         7862.0             8939.0

In [36]:
ebola.interpolate().iloc[0:10,0:5]  ##interpolate : 누락값 양쪽에 있는 값을 이용하여 중간값 구해서 대체. 선형보간

         Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
0    1/5/2015  289        2776.0            NaN            10030.0
1    1/4/2015  288        2775.0            NaN             9780.0
2    1/3/2015  287        2769.0         8166.0             9722.0
3    1/2/2015  286        2749.5         8157.0             9677.5
4  12/31/2014  284        2730.0         8115.0             9633.0
5  12/28/2014  281        2706.0         8018.0             9446.0
6  12/27/2014  280        2695.0         7997.5             9409.0
7  12/24/2014  277        2630.0         7977.0             9203.0
8  12/21/2014  273        2597.0         7919.5             9004.0
9  12/20/2014  272        2571.0         7862.0             8939.0

### 5. 누락값 삭제하기
- dropna()

In [36]:
print(ebola.shape)

(122, 18)

In [37]:
ebola_dropna = ebola.dropna() #threshold: drop하는 기준
print(ebola_dropna.shape)

(1, 18)

In [38]:
print(ebola_dropna)

          Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone  \
19  11/18/2014  241        2047.0         7082.0             6190.0

    Cases_Nigeria  Cases_Senegal  Cases_UnitedStates  Cases_Spain  Cases_Mali  \
19           20.0            1.0                 4.0          1.0         6.0

    Deaths_Guinea  Deaths_Liberia  Deaths_SierraLeone  Deaths_Nigeria  \
19         1214.0          2963.0              1267.0             8.0

    Deaths_Senegal  Deaths_UnitedStates  Deaths_Spain  Deaths_Mali
19             0.0                  1.0           0.0          6.0

### 연습문제
- 각 행에 대해 결측치가 5개 이상인 행을 제거
- 각 열에 대해 결측치가 50% 이항인 열 제거

In [51]:
ebola.shape[1]

18

In [65]:
ebola.dropna(thresh=14,axis=0).isna().sum()

Date                    0
Day                     0
Cases_Guinea            1
Cases_Liberia          12
Cases_SierraLeone       0
Cases_Nigeria           0
Cases_Senegal           0
Cases_UnitedStates      0
Cases_Spain             1
Cases_Mali              4
Deaths_Guinea           1
Deaths_Liberia         12
Deaths_SierraLeone      0
Deaths_Nigeria          0
Deaths_Senegal          0
Deaths_UnitedStates     0
Deaths_Spain            1
Deaths_Mali             4
dtype: int64

In [66]:
ebola_dropna1=ebola.dropna(thresh=14,axis=0)

ebola_dropna1.shape

(15, 18)

In [61]:
ebola_dropna2=ebola.dropna(thresh=0.5,axis=1)

ebola_dropna2.shape

(122, 18)

In [62]:
ebola_dropna2=ebola.dropna(thresh=10,axis=1)
ebola_dropna2.shape

(122, 18)

# 직접 해보세요!
## 누락값이 포함된 데이터 계산하기(147쪽)

In [70]:
ebola['Cases_multiple'] = ebola['Cases_Guinea'] + ebola['Cases_Liberia'] + ebola['Cases_SierraLeone']
ebola['Cases_multiple'].sum()

197682.0

In [58]:
ebola_subset = ebola.loc[:, ['Cases_Guinea', 'Cases_Liberia', 'Cases_SierraLeone', 'Cases_multiple']] 
print(ebola_subset.head(n=10))

   Cases_Guinea  Cases_Liberia  Cases_SierraLeone  Cases_multiple
0        2776.0            NaN            10030.0             NaN
1        2775.0            NaN             9780.0             NaN
2        2769.0         8166.0             9722.0         20657.0
3           NaN         8157.0                NaN             NaN
4        2730.0         8115.0             9633.0         20478.0
5        2706.0         8018.0             9446.0         20170.0
6        2695.0            NaN             9409.0             NaN
7        2630.0         7977.0             9203.0         19810.0
8        2597.0            NaN             9004.0             NaN
9        2571.0         7862.0             8939.0         19372.0

In [59]:
print(ebola.Cases_Guinea.sum(skipna = True))  #skipna = 결측값은 무시하기

84729.0

In [60]:
print(ebola.Cases_Guinea.sum(skipna = False))

nan

### 연습문제 결측치 완전 대체하기

In [41]:
result=ebola.fillna(method='ffill')
result=result.fillna(method='bfill')
result.describe()

,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
count,122.000000,122.000000,122.000000,122.000000,122.000000,122.000000,122.000000,122.0,122.000000,122.000000,122.000000,122.000000,122.000000,122.0,122.000000,122.000000,122.000000
mean,144.778689,1023.729508,2898.614754,2603.352459,10.795082,1.016393,1.942623,1.0,2.090164,637.319672,1303.565574,726.401639,4.139344,0.0,0.336066,0.696721,1.918033
std,89.316460,860.047279,3175.472744,3160.616910,9.706382,0.181071,1.362419,0.0,2.252654,521.549159,1355.180309,849.199688,3.857622,0.0,0.474310,0.461570,1.900805
min,0.000000,49.000000,3.000000,0.000000,0.000000,1.000000,1.000000,1.0,1.000000,29.000000,2.000000,0.000000,0.000000,0.0,0.000000,0.000000,1.000000
25%,66.250000,283.500000,28.500000,24.500000,0.000000,1.000000,1.000000,1.0,1.000000,187.750000,13.000000,5.250000,0.000000,0.0,0.000000,0.000000,1.000000
50%,150.000000,593.000000,1027.000000,908.500000,15.500000,1.000000,1.000000,1.0,1.000000,401.000000,600.000000,383.000000,4.500000,0.0,0.000000,1.000000,1.000000
75%,219.500000,1752.750000,6535.000000,4836.250000,20.000000,1.000000,4.000000,1.0,1.000000,1012.750000,2703.000000,1196.750000,8.000000,0.0,1.000000,1.000000,1.000000
max,289.000000,2776.000000,8166.000000,10030.000000,22.000000,3.000000,4.000000,1.0,7.000000,1786.000000,3496.000000,2977.000000,8.000000,0.0,1.000000,1.000000,6.000000

In [43]:
ebola.fillna(method='ffill').fillna(method='bfill', limit=20).isna().sum().sum()  #결측치 없다

0

In [47]:
ebola.interpolate(method='ffill').interpolate(method='bfill').isna().sum().sum()

0

### 연습문제
- describe 메소드를 이용하여 각 변수별 결측값의 수를 계산하라

In [19]:
ebola.describe().iloc[0]

Day                    122.0
Cases_Guinea            93.0
Cases_Liberia           83.0
Cases_SierraLeone       87.0
Cases_Nigeria           38.0
Cases_Senegal           25.0
Cases_UnitedStates      18.0
Cases_Spain             16.0
Cases_Mali              12.0
Deaths_Guinea           92.0
Deaths_Liberia          81.0
Deaths_SierraLeone      87.0
Deaths_Nigeria          38.0
Deaths_Senegal          22.0
Deaths_UnitedStates     18.0
Deaths_Spain            16.0
Deaths_Mali             12.0
Name: count, dtype: float64

In [26]:
len(ebola)-ebola.describe().iloc[0]

Day                      0.0
Cases_Guinea            29.0
Cases_Liberia           39.0
Cases_SierraLeone       35.0
Cases_Nigeria           84.0
Cases_Senegal           97.0
Cases_UnitedStates     104.0
Cases_Spain            106.0
Cases_Mali             110.0
Deaths_Guinea           30.0
Deaths_Liberia          41.0
Deaths_SierraLeone      35.0
Deaths_Nigeria          84.0
Deaths_Senegal         100.0
Deaths_UnitedStates    104.0
Deaths_Spain           106.0
Deaths_Mali            110.0
Name: count, dtype: float64

In [28]:
ebola.shape[0] == len(ebola)

True